/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示了LPTIM使用RCL作为时钟源，每1秒产生1次自动重载匹配中断的功能。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
    
    /* LPTIM1初始化 */
    lptim1_init();
    
    /* NVIC初始化 */
    nvic_init();
    
    /* LPTIM1启动计数单次计数，并使能自动重载匹配中断 */
    bsp_lptim_start();

    while(1)
    {
       
    }
}

