/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示SPI从模式下，进行全双工数据收发的功能。
*                     SPI采用中断方式通信。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{
    /* 配置系统时钟 */
    system_clock_config();
  
    /* GPIO初始化 */
    gpio_init();
    
    /* SPI初始化，配置为从模式 */
    spi1_init();
    
    /* NVIC初始化 */
    nvic_init();
    
    /* 等待发送完成 */
    while(g_send_count < 8);
    
    /* 等待接收完成 */
    while(g_recv_count < 8);
    
    while(1)
    {
    }
}












