/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示TIM1 3路互补通道的PWM输出功能。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/

int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
    
    /* GPIO初始化 */
    gpio_init();        
    
    /* TIM1初始化 */
    tim1_init();
    
    /* TIM1带互补通道的PWM模式输出 */
    bsp_tim1_complementary_output();
    
    /* 等待触发断路事件 */
    while(1)
    {
       
    }
}

