/************************************************************************************************/
/**
* @file               tim_bsp.c
* @author             MCU Ecosystem Development Team
* @brief              TIM BSP驱动函数，实现TIM互补输出及断路功能配置。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "tim_bsp.h"

/*-------------------------------------------functions------------------------------------------*/
/**
* @brief  使能TIM1带互补通道输出，并启动计数
* @retval 无
*/
void bsp_tim1_complementary_output(void)
{
    /* 使能输出 */
    std_tim_moen_enable(TIM1);

    /* 使能计数 */
    std_tim_enable(TIM1);    
}

