/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示I2C从机模式下中断方式进行数据接收和数据发送的流程。
*                     注意：当LED点亮时指示I2C从模式就绪，主机应等待从机就绪后发起通信。
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/

int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
    
    /* I2C1和LED GPIO初始化 */
    gpio_init();
    
    /* I2C1初始化为从模式 */
    i2c1_slave_init();
    
    /* NVIC初始化 */
    nvic_init();
    
    /* LED常亮，指示从机就绪 */
    std_gpio_reset_pin(LED_GPIO_PORT, LED_PIN);
    
    while(1)
    {
       
    }
}




