/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示外部触发信号上升沿有效时，同时触发TIM1/TIM3计数，并同步输出PWM波形。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/

int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
   
    /* GPIO初始化 */
    gpio_init();
    
    /* TIM1、TIM3初始化 */
    tim1_init();
    tim3_init();
    
    /* 配置TIM级联，并启动计数 */
    bsp_tim_sync_start();
    
    
    /* 等待触发信号有效 */
    while(1)
    {
       
    }
}

