/************************************************************************************************/
/**
* @file               tim_bsp.c
* @author             MCU Ecosystem Development Team
* @brief              TIM BSP驱动函数，实现TIM异步触发同步输出功能配置。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "tim_bsp.h"

/*-------------------------------------------functions------------------------------------------*/
/**
* @brief  TIM3输入通道使能，并启动TIM1/3计数
* @retval 无
*/
void bsp_tim_sync_start(void)
{    
    /* 使能输出 */
    std_tim_moen_enable(TIM1);
    
    /* 使能TIM1计数 */
    std_tim_enable(TIM1);       
    
    /* 使能TIM3计数 */
    std_tim_enable(TIM3);       
}

