/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示TIM1每1s触发一次更新事件的功能。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"


/*-------------------------------------------functions------------------------------------------*/

int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();
       
    /* TIM1初始化 */
    tim1_init();
    
    /* NVIC初始化 */
    nvic_init();
    
    /* TIM1启动计数 */
    bsp_tim1_start_interrupt();
    
    while(1)
    {

    }  
}


