/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示TIM3通道1触发信号上升沿有效时, 通道2输出单脉冲的功能。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"


/*-------------------------------------------functions------------------------------------------*/
int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();

    /* GPIO初始化 */
    gpio_init();    
           
    /* TIM3初始化 */
    tim3_init();
        
    /* 使能单脉冲模式 */
    std_tim_onepulse_enable(TIM3);    
    
    /* 等待触发单脉冲 */
    while(1)
    {

    }  
}


