/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示霍尔传感器接口功能；
*                     当TI1、TI2、TI3通道信号翻转时，触发TIM3 CNT复位，且捕获复位前的CNT值到CC1寄存器中。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*------------------------------------------functions-------------------------------------------*/
int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();
    
    /* GPIO初始化 */
    gpio_init();
    
    /* TIM3初始化 */
    tim3_init();

    /* NVIC初始化 */
    nvic_init();
    
    /* 配置TIM3 霍尔接口，并启动 */
    bsp_tim3_hall_start();
    
    while(1)
    {

    }  
}


