/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示TIM3输入捕获功能，当外部信号上升沿有效时，触发捕获事件。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*------------------------------------------functions-------------------------------------------*/
int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();
    
    /* GPIO初始化 */
    gpio_init();
    
    /* TIM3初始化 */
    tim3_init();

    /* NVIC初始化 */
    nvic_init();
    
    /* TIM3输入捕获 */
    bsp_tim3_capture_start();
    
    while(1)
    {

    }  
}


