/************************************************************************************************/
/**
* @file               ciu32f003_std.h
* @author             MCU Ecosystem Development Team
* @brief              CIU32F003 STD库对外一级头文件。                           
*                     用户使用STD库时，可以仅引用该头文件即可。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*避免头文件重复引用*/
#ifndef CIU32F003_STD_H
#define CIU32F003_STD_H   


/************************************************************************************************/
/**
* @addtogroup CIU32F003_STD_Driver
* @{
*/

/**
* @defgroup STD STD
* @brief 支持STD库的计时等功能以及STD库对外的统一头文件
* @{
*
*/
/************************************************************************************************/  

#ifdef __cplusplus
extern "C" {
#endif

/*------------------------------------------includes--------------------------------------------*/
#include "ciu32f003_std_config.h"

/*--------------------------------------------define--------------------------------------------*/

/************************************************************************************************/
/**
* @defgroup STD_Constants STD Constants
* @brief STD库基础功能的常量定义以及宏定义
* @{
*
*/
/************************************************************************************************/   

/* STD库的计时有关配置 */
#define STD_DELAY_US                     (SystemCoreClock/1000000)                      /**< STD中用于计时的基础值，与计时周期有关 */ 


/** 
* @} 
*/
/*-------------------------------------------functions------------------------------------------*/

/************************************************************************************************/
/**
* @defgroup STD_External_Functions STD External Functions
* @brief    STD库基础功能对外API
* @{
*
*/
/************************************************************************************************/ 
/* STD库计时有关函数 */
void std_delay_init(void);
void std_delayus(uint32_t count);
void std_delayms(uint32_t count);
void std_delayus_start(uint32_t count);
void std_delayms_start(uint32_t count);
bool std_delay_end(void);


/** 
* @} 
*/


#ifdef __cplusplus
}
#endif

/**
* @} 
*/  

/**
* @}
*/


#endif /* CIU32F003_STD_H */


