/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示IRTIM的用法。载波信号是TIM1_CH1（38KHz）,调试信号是UART1（2400bps）。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*------------------------------------------functions-------------------------------------------*/
int main(void)
{      
    /* 配置系统时钟 */
    system_clock_config(); 

    /* GPIO初始化 */
    gpio_init();
    
    /* TIM1 初始化 */
    tim1_init();
    
    /* UART1 初始化 */
    uart1_init();

   /* IRTIM初始化 */
    irtim_init();
    
    /* 控制IRTIM调制解调红外信号 */
    bsp_irtim_modulation();
    
    while(1)
    {
        
    }
}










