/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示使用GPIO模拟I2C主机的发送和接收流程。
*                     注意：该主机程序不支持时钟延长，I2C通信速率约150K。
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/

int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
    
    /* GPIO初始化 */
    gpio_init();
    
    /* I2C主机发送 */
    bsp_i2c_master_send();
    
    /* I2C主机接收 */
    bsp_i2c_master_receive();
    
    while(1)
    {
    }
}




