/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示每1.5s实现一次喂狗操作，保证芯片不会触发复位；
*                     IWDG喂狗不及时会导致芯片复位，需全速运行观测效果。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/

int main(void)
{
    /* 配置系统时钟 */
    system_clock_config(); 

    /* 初始化LED */
    gpio_init(); 

    /* Systick初始化 */
    std_delay_init();

    /* IWDG初始化 */
    iwdg_init();

    while(1)
    {
        /* 翻转LED状态 */
        std_gpio_toggle_pin(LED_GPIO_PORT, LED_PIN);

        /* 延时1500ms */
        std_delayms(1500);

        /* 写入重载值 */
        std_iwdg_refresh();
    }
}

