/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示TIM3 2通道输出PWM波形，此模式下TIM3计数精度为16bit。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"


/*-------------------------------------------functions------------------------------------------*/
int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();
    
    /* GPIO初始化 */
    gpio_init();
    
    /* TIM3初始化（工作模式0） */
    tim3_init();
    
    /* 启动计数（输出PWM） */
    std_tim_enable(TIM3);
    
    while(1)
    {

    }  
}


