/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示MCO通过PA7输出系统时钟的16分频功能。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{
    /* 配置系统时钟为RCH（48MHz） */
    system_clock_config();
    
    /* GPIO初始化 */
    gpio_init();

    /* 使能MCO输出，系统时钟 16分频 */
    std_rcc_mco_config(RCC_MCO_SRC_SYSCLK, RCC_MCO_DIV16);
    
    while(1)
    {

    }
}


